app/controllers/api/oils_controller.rb

  def index
    render json: Oil.all
---
SELECT "oils".* FROM "oils"

  def create
    oil = Oil.new[oil_params]
    if oil.save
---
INSERT INTO "oils" ("name", "uses", "description", "img_url", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "peppermint"], ["uses", "digestion"], ["description", "minty"], ["img_url", ""], ["created_at", "2021-02-26 12:22:24.709297"], ["updated_at", "2021-02-26 12:22:24.709297"]]

  def destroy
    if @oil.destroy
---
DELETE FROM "oils" WHERE "oils"."id" = ?  [["id", 1]]

  def set_oil
    @oil = Oil.find_by(id: params[:id])
---
SELECT "oils".* FROM "oils" WHERE "oils"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]